# Pandas Overview

## Series

In [2]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c'] #list
my_list = [1, 2, 3] #list
arr = np.array([10, 20, 30]) #np array

d = {'a':10, 'b':20, 'c':30} #dictionary

In [3]:
pd.Series(data = my_list, index = labels)

a    1
b    2
c    3
dtype: int64

In [4]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series([1, 2, 3], ['A', 'B', 'C'])

A    1
B    2
C    3
dtype: int64

In [7]:
grades_1st = pd.Series([1, 1.5, 1.25],['TEECE','PS','ACECE7'])
grades_1st

TEECE     1.00
PS        1.50
ACECE7    1.25
dtype: float64

In [8]:
grades_2nd = pd.Series([1.25, 1.25, 1],['TEECE','PS','Seminars'])
grades_2nd

TEECE       1.25
PS          1.25
Seminars    1.00
dtype: float64

In [9]:
grades_1st + grades_2nd

ACECE7       NaN
PS          2.75
Seminars     NaN
TEECE       2.25
dtype: float64

## DataFrame

In [10]:
from numpy.random import randint

In [11]:
columns= ['S1', 'S2', 'S3', 'S4'] # four columns
index= ['Day1', 'Day2', 'Day3', 'Day4', 'Day5'] # five rows

In [12]:
np.random.seed(14)
data = randint(-100, 100, (5,4))
data

array([[   7,  -12,  -88,   50],
       [ -29,    2,   56,   38],
       [ -39,    9,   54,  -75],
       [ -68,  -96,   38,   38],
       [-100,  -16,   33,  -63]])

In [67]:
df = pd.DataFrame(data, index, columns)
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [14]:
df['S1']

Day1      7
Day2    -29
Day3    -39
Day4    -68
Day5   -100
Name: S1, dtype: int32

In [15]:
df[['S1', 'S2']]

       S1  S2
Day1    7 -12
Day2  -29   2
Day3  -39   9
Day4  -68 -96
Day5 -100 -16

In [16]:
df['S_average'] = (df['S1'] + df['S2'] + df['S3'] + df['S4'])/4

In [17]:
df

       S1  S2  S3  S4  S_average
Day1    7 -12 -88  50     -10.75
Day2  -29   2  56  38      16.75
Day3  -39   9  54 -75     -12.75
Day4  -68 -96  38  38     -22.00
Day5 -100 -16  33 -63     -36.50

In [18]:
df = df.drop('S_average', axis = 1)

In [19]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [20]:
df.loc['Day1']

S1     7
S2   -12
S3   -88
S4    50
Name: Day1, dtype: int32

In [21]:
df.loc[['Day1', 'Day3']]

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day3 -39   9  54 -75

In [22]:
df.iloc[0]

S1     7
S2   -12
S3   -88
S4    50
Name: Day1, dtype: int32

In [23]:
df.iloc[[0,2]]

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day3 -39   9  54 -75

In [24]:
df[['S1','S3']]

       S1  S3
Day1    7 -88
Day2  -29  56
Day3  -39  54
Day4  -68  38
Day5 -100  33

In [25]:
df.loc[['Day1','Day3']]

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day3 -39   9  54 -75

In [26]:
df.iloc[[0,2]]

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day3 -39   9  54 -75

In [35]:
df.drop('Day4', axis = 0)

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day2 -29   2  56  38
Day3 -39   9  54 -75

In [36]:
df

      S1  S2  S3  S4
Day1   7 -12 -88  50
Day2 -29   2  56  38
Day3 -39   9  54 -75
Day4 -68 -96  38  38

In [38]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [39]:
df.loc[['Day4','Day5'],['S1','S2']]

       S1  S2
Day4  -68 -96
Day5 -100 -16

In [40]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [41]:
df[df>0]

       S1   S2    S3    S4
Day1  7.0  NaN   NaN  50.0
Day2  NaN  2.0  56.0  38.0
Day3  NaN  9.0  54.0   NaN
Day4  NaN  NaN  38.0  38.0
Day5  NaN  NaN  33.0   NaN

In [44]:
df[df['S2'] > 0]

      S1  S2  S3  S4
Day2 -29   2  56  38
Day3 -39   9  54 -75

In [43]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [46]:
df[df['S2'] > 0]['S3'] #get all data with S2 positive and display value of S3

Day2    56
Day3    54
Name: S3, dtype: int32

In [55]:
df[(df['S1'] > -40) & (df['S4'] >30)][['S1','S4']]

      S1  S4
Day1   7  50
Day2 -29  38

In [68]:
df

       S1  S2  S3  S4
Day1    7 -12 -88  50
Day2  -29   2  56  38
Day3  -39   9  54 -75
Day4  -68 -96  38  38
Day5 -100 -16  33 -63

In [69]:
df = df.reset_index()

In [70]:
df

  index   S1  S2  S3  S4
0  Day1    7 -12 -88  50
1  Day2  -29   2  56  38
2  Day3  -39   9  54 -75
3  Day4  -68 -96  38  38
4  Day5 -100 -16  33 -63

In [60]:
newind = ['D1', 'D2', 'D3', 'D4', 'D5']

In [71]:
df['index'] = newind

In [72]:
df

  index   S1  S2  S3  S4
0    D1    7 -12 -88  50
1    D2  -29   2  56  38
2    D3  -39   9  54 -75
3    D4  -68 -96  38  38
4    D5 -100 -16  33 -63

In [73]:
df.set_index('index')

        S1  S2  S3  S4
index
D1       7 -12 -88  50
D2     -29   2  56  38
D3     -39   9  54 -75
D4     -68 -96  38  38
D5    -100 -16  33 -63

In [74]:
df = df.reset_index()

In [75]:
df

   level_0 index   S1  S2  S3  S4
0        0    D1    7 -12 -88  50
1        1    D2  -29   2  56  38
2        2    D3  -39   9  54 -75
3        3    D4  -68 -96  38  38
4        4    D5 -100 -16  33 -63

## Missing Data

In [76]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})

In [77]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [78]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [79]:
df.dropna(axis = 1)

    C
0  10
1  20
2  30
3  40

In [87]:
df.fillna(value=df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [85]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

## GroupBy

In [3]:
df = pd.read_csv('Data/Universities.csv')

FileNotFoundError: [Errno 2] File b'Data/Universities.csv' does not exist: b'Data/Universities.csv'

In [89]:
df

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada
...,...,...,...,...,...
202,"Private for-profit, 2-year",Carrington College-Las Vegas,2012,120,Nevada
203,"Public, 4-year or above",Western Nevada College,2012,495,Nevada
204,"Private for-profit, 2-year",Nevada Career Institute,2012,101,Nevada
205,"Private not-for-profit, 2-year",Expertise Cosmetology Institute,2012,129,Nevada
206,"Public, 2-year",Truckee Meadows Community College,2012,1170,Nevada

In [90]:
df.groupby('Year')

In [99]:
a = df.groupby(['Year', 'Sector']).count()

<table><td><tt
><span
>count</span></tt></td><td>Number of non-null observations</td></tr><tr
><td><tt
><span
>sum</span></tt></td><td>Sum of values</td></tr><tr
><td><tt
><span
>mean</span></tt></td><td>Mean of values</td></tr><tr
><td><tt
><span
>mad</span></tt></td><td>Mean absolute deviation</td></tr><tr
><td><tt
><span
>median</span></tt></td><td>Arithmetic median of values</td></tr><tr
><td><tt
><span
>min</span></tt></td><td>Minimum</td></tr><tr
><td><tt
><span
>max</span></tt></td><td>Maximum</td></tr><tr
><td><tt
><span
>mode</span></tt></td><td>Mode</td></tr><tr
><td><tt
><span
>abs</span></tt></td><td>Absolute Value</td></tr><tr
><td><tt
><span
>prod</span></tt></td><td>Product of values</td></tr><tr
><td><tt
><span
>std</span></tt></td><td>Unbiased standard deviation</td></tr><tr
><td><tt
><span
>var</span></tt></td><td>Unbiased variance</td></tr><tr
><td><tt
><span
>sem</span></tt></td><td>Unbiased standard error of the mean</td></tr><tr
><td><tt
><span
>skew</span></tt></td><td>Unbiased skewness (3rd moment)</td></tr><tr
><td><tt
><span
>kurt</span></tt></td><td>Unbiased kurtosis (4th moment)</td></tr><tr
><td><tt
><span
>quantile</span></tt></td><td>Sample quantile (value at %)</td></tr><tr
><td><tt
><span
>cumsum</span></tt></td><td>Cumulative sum</td></tr><tr
><td><tt
><span
>cumprod</span></tt></td><td>Cumulative product</td></tr><tr
><td><tt
><span
>cummax</span></tt></td><td>Cumulative maximum</td></tr><tr
><td><tt
><span
>cummin</span></tt></td><td>Cumulative minimum</td></tr></tbody></table>

In [2]:
a = df.groupby(['Year', 'Sector']).count()
a.drop(['Completions', 'Geography'], axis = 1)

NameError: name 'df' is not defined

## Operations

In [117]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,200,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [118]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   200   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [112]:
#unique
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [113]:
#nunique
df_one['col2'].nunique()

5

In [114]:
#value_counts
df_one['col2'].value_counts()

WA    2
NY    1
CA    1
AK    1
NV    1
Name: col2, dtype: int64

In [115]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [119]:
#drop duplicates
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   200   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [125]:
#combining dataframes
features = pd.DataFrame({'Acad':[100,200,300,400,500],
                        'TS':[12,13,14,15,16]})
predictions = pd.DataFrame({'Job':[0,1,1,0,1]})

In [126]:
features

   Acad  TS
0   100  12
1   200  13
2   300  14
3   400  15
4   500  16

In [127]:
predictions

   Job
0    0
1    1
2    1
3    0
4    1

In [129]:
pd.concat([features,predictions], axis = 1)

   Acad  TS  Job
0   100  12    0
1   200  13    1
2   300  14    1
3   400  15    0
4   500  16    1